{
  "backend/main.mo": "Backend canister handling user profiles, inquiries, and invoices with access control and special logic for anonymous LOC invoice creation.",
  "feature_evidence.json": "Feature evidence mapping detailing removed Intake UI elements, affected frontend files, related components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing summarized descriptions of major frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining light/dark theme color tokens and base styles.",
  "frontend/index.html": "HTML entry point defining root app container and loading the main frontend script.",
  "frontend/src/App.tsx": "Main React app configuring router, routes, layout, React Query provider, and global toaster.",
  "frontend/src/components/ClaimDetailsDialog.tsx": "Dialog component displaying invoice claim details and hospice day counts.",
  "frontend/src/components/Footer.tsx": "Footer component rendering copyright text and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Navigation header with dropdown menus for billing, hospice, and account sections using router state and click/keyboard handlers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when the identity or actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling authentication state, login, logout, and persistence via AuthClient.",
  "frontend/src/hooks/useLocInvoiceReceivables.ts": "Hooks for fetching and deleting LOC receivables, including optimistic cache updates and detailed deletion result handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for inquiries, LOC inquiries, and invoices, supporting fetch, create, update, and delete operations with cache invalidation.",
  "frontend/src/index.css": "Tailwind-based theme definitions with healthcare-styled color variables and dark mode overrides.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/Billing.tsx": "Renders the Billing page with feature cards for invoices, payments, insurance claims, and financial reports.",
  "frontend/src/pages/Home.tsx": "Displays the home page with a hero section and a services feature linking to the Billing page.",
  "frontend/src/pages/HospiceBilling.tsx": "Simple page providing a header and description for hospice billing management.",
  "frontend/src/pages/Intake.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/IntakeRedirect.tsx": "Automatically redirects users to the Billing page on mount.",
  "frontend/src/pages/LocInvoiceReceivable.tsx": "Manages LOC invoice receivables, including display, selection, deletion, and viewing invoice details.",
  "frontend/src/pages/ManifestLocBilling.tsx": "Loads and displays a LOC inquiry and allows invoice creation from it with success and error handling.",
  "frontend/src/pages/ManifestRbBilling.tsx": "Renders an R&B manifest table with selectable records and placeholder invoice creation logic.",
  "frontend/src/pages/RbInvoiceReceivable.tsx": "Displays and manages R&B receivable invoices with selection and deletion capabilities.",
  "frontend/src/pages/Ub04Form.tsx": "Renders a UB04 form preview with a red-lined template image and simple overlay fields plus a back button.",
  "frontend/src/utils/authErrorMessages.ts": "Normalizes backend auth and network error messages into user-friendly text and detects auth-related errors.",
  "frontend/src/utils/deleteResultsMessaging.ts": "Formats bulk delete outcomes into short success or error messages and extracts simplified failure reasons.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Defines current project state, objectives, architectural notes, and known issues for the billing-focused app."
}