{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, invoices, and inquiries with create, update, and query methods.",
  "feature_evidence.json": "Feature evidence report linking two LOC Billing features to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend files including pages, hooks, and components.",
  "frontend/index.css": "Tailwind base and theme configuration defining OKLCH color tokens and dark mode variables for the app.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app setup configuring TanStack Router, React Query, global layout, and all route definitions.",
  "frontend/src/components/ClaimDetailsDialog.tsx": "Dialog component showing invoice details and hospice day breakdown for receivables pages.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright, branding, and a tracked link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header component with navigation links and dropdown menus that manage open state and close on outside click or Escape.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useLocInvoiceReceivables.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for invoices, inquiries, and LOC inquiries using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables with a healthcare‑themed color palette.",
  "frontend/src/main.tsx": "Application entry that initializes React, sets up QueryClient, and wraps the app in Internet Identity and query providers.",
  "frontend/src/pages/Billing.tsx": "Static Billing page showing feature cards and descriptions for billing, invoices, payments, and financial tools.",
  "frontend/src/pages/Home.tsx": "Landing page with hero, navigation links to intake and billing, service descriptions, and feature cards.",
  "frontend/src/pages/HospiceBilling.tsx": "Simple page displaying a header and description for hospice billing management.",
  "frontend/src/pages/Intake.tsx": "Intake page with sections for patient info, scheduling, contacts, communication, and onboarding guidance.",
  "frontend/src/pages/LocInvoiceReceivable.tsx": "Displays and manages LOC invoice receivables with filtering, selection, deletion, and invoice detail dialog.",
  "frontend/src/pages/ManifestLocBilling.tsx": "Loads LOC inquiry data, allows selection, and creates invoices from the selected record.",
  "frontend/src/pages/ManifestRbBilling.tsx": "Frontend-only R&B billing manifest page with empty records, selection handling, and placeholder invoice creation.",
  "frontend/src/pages/RbInvoiceReceivable.tsx": "Displays and manages R&B invoice receivables with filtering, selection, and deletion capabilities.",
  "frontend/src/pages/Ub04Form.tsx": "Renders a UB04 form page displaying a red-line template image with overlay fields and a back button to LOC Receivables.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes current project state, required navigation and billing workflow updates, known issues, and existing feature definitions."
}