{
  "backend/main.mo": "Main canister implementing access control, user profiles, inquiries, and invoice creation with special handling for anonymous LOC invoices.",
  "backend/migration.mo": "Migration script updating LOC sample invoices by clearing dischargeDate when matching specific criteria.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing routing, pages, components, and backend hooks.",
  "frontend/index.css": "Tailwind base layer defining light and dark mode OKLCH color tokens and global background/foreground styles.",
  "frontend/index.html": "HTML entrypoint containing root div and module script loading the main React app.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router, QueryClient, and layout with header and footer across all routes.",
  "frontend/src/components/ClaimDetailsDialog.tsx": "Dialog component displaying claim details with invoice metadata and optional cancel-invoice action.",
  "frontend/src/components/CreateLocInvoiceDialog.tsx": "Dialog component allowing users to pick invoice and transaction dates and submit them; manages date state, formatting, and submit availability.",
  "frontend/src/components/Footer.tsx": "Footer displaying current year, branding, and a referral link to caffeine.ai with dynamic hostname tracking.",
  "frontend/src/components/Header.tsx": "Header with navigation, dropdown menus for Billing and Account, and logic to open/close menus based on user interactions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for managing Internet Identity login, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useLocInvoiceReceivables.ts": "Hooks for fetching LOC receivables and deleting single or multiple LOC invoices with cache updates and query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for inquiries and invoices, including fetch, create, update, and delete operations with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark healthcare-themed color palettes, plus base typography and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Billing.tsx": "UI page showing billing features with cards for invoices, payments, claims, reports, and a security notice.",
  "frontend/src/pages/Home.tsx": "Landing page with a hero section, billing-focused marketing content, and a link to the Billing page.",
  "frontend/src/pages/HospiceBilling.tsx": "Simple page header and description for hospice billing management.",
  "frontend/src/pages/Intake.tsx": "Empty placeholder file for Intake page.",
  "frontend/src/pages/IntakeRedirect.tsx": "Redirects users to the Billing page on mount using router navigation.",
  "frontend/src/pages/LocInvoiceReceivable.tsx": "Page for displaying, selecting, viewing, and deleting LOC invoices with backend integration and dialogs.",
  "frontend/src/pages/ManifestLocBilling.tsx": "Displays a single LOC inquiry, allows selecting it, and supports creating an invoice through a dialog with backend calls.",
  "frontend/src/pages/ManifestRbBilling.tsx": "Frontend-only R&B billing manifest page with record selection and stubbed invoice creation.",
  "frontend/src/pages/RbInvoiceReceivable.tsx": "Renders the R&B Receivables page with display, selection, and bulk‑delete behavior for pending non‑LOC invoices.",
  "frontend/src/pages/Ub04Form.tsx": "Displays a UB04 red‑form template page with simple static invoice overlays and a back link to LOC receivables.",
  "frontend/src/utils/authErrorMessages.ts": "Normalizes authentication and authorization error messages and provides a helper to detect auth‑related errors.",
  "frontend/src/utils/deleteResultsMessaging.ts": "Formats bulk delete results into user‑friendly success or error messages and extracts concise failure reasons.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin setup for the frontend UI.",
  "project_state.json": "Tracks the project’s current billing‑only direction, required navigation and receivables changes, and known issues in the workflow."
}