{
  "kind": "build_request",
  "title": "Fix anonymous invoice cancellation/deletion and correct LOC SOC/Discharge dates",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-89",
      "text": "Fix invoice deletion/cancellation so it works without requiring Internet Identity sign-in for the LOC sample invoice flow (including when deleting from the LOC Receivables page and when clicking the \"Cancel Invoice\" button in the \"Claim details\" dialog).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Delete/cancelling invoice not working, its asking for sign in to delete"
        ]
      },
      "acceptanceCriteria": [
        "When not signed in, a user can delete LOC invoices returned by getLOCReceivables() from the LOC Receivables page using the Delete button without any sign-in prompt or authorization trap.",
        "When not signed in, a user can delete a LOC invoice from within the \"Claim details\" popup by clicking the button labeled exactly \"Cancel Invoice\" without any sign-in prompt or authorization trap.",
        "After a successful delete (bulk delete or Cancel Invoice), the deleted invoice(s) are removed from the LOC Receivables grid immediately (no manual refresh required).",
        "Deleting a LOC sample invoice restores the LOC sample inquiry availability so that clicking Display on the Manifest LOC Billing page can show the LOC inquiry again afterward (as per the existing LOC sample availability lifecycle).",
        "If a delete fails for a non-auth reason, the UI shows a clear English error message and remains usable (no stuck loading state)."
      ]
    },
    {
      "id": "REQ-90",
      "text": "Update the LOC sample inquiry \"SOC Date\" value to \"1/1/2026\" and ensure the \"Discharge Date\" is blank/empty in the Manifest LOC Billing inquiry grid and in any stored invoice data derived from that inquiry.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Update the SOC Date to 1/1/2026 and discharge date blank(empty)"
        ]
      },
      "acceptanceCriteria": [
        "On the Manifest LOC Billing page, after clicking Display, the Status column shows SOC Date exactly \"1/1/2026\" for the PhilipTest row.",
        "On the Manifest LOC Billing page, after clicking Display, the Status column shows Discharge Date as blank/empty for the PhilipTest row (no date text is rendered).",
        "When creating an invoice from the displayed LOC inquiry, the invoice stores the SOC Date value as \"1/1/2026\" and stores Discharge Date as empty (null/undefined/empty string), and the LOC Receivables \"Claim details\" popup displays SOC Date as \"1/1/2026\" (and does not display any discharge date value).",
        "The backend LOC sample invoice detection logic (used to allow anonymous behavior and to toggle sample availability) remains consistent with the updated SOC/Discharge date values, so LOC creation/deletion rules still apply to the sample invoice."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not introduce new authentication providers (only Internet Identity is allowed).",
    "Do not change navigation structure, routes, or add new pages beyond what is necessary to fix delete/cancel and SOC/Discharge date values.",
    "Do not redesign the UI theme or styling as part of this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}