{
  "kind": "build_request",
  "title": "Remove Intake navigation and Intake dashboard content for a Billing-only experience",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-79",
      "text": "Remove the \"Intake\" top-level navigation item from the header so the primary navigation is Billing-focused and no \"Intake\" menu entry is shown anywhere in the Header UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "1. Remove the Intake Menu and its associated blogs its not required"
        ]
      },
      "acceptanceCriteria": [
        "The header no longer renders a top-level navigation link labeled \"Intake\".",
        "The remaining header menus (e.g., Billing and Account) continue to function and open/close as before."
      ]
    },
    {
      "id": "REQ-80",
      "text": "Remove all Patient Intake/Intake promotional content from the Home (dashboard/landing) page so the dashboard presents a Billing-only experience (e.g., remove the Intake CTA button/link, remove the Intake service card/section, and remove intake-related marketing copy).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "2. Remove patient intake from dashboad I only want billing"
        ]
      },
      "acceptanceCriteria": [
        "Home page no longer contains a CTA button/link that navigates to \"/intake\" or is labeled \"Patient Intake\"/\"Intake\".",
        "Home page no longer contains an \"Intake\" service card or any intake-related \"blog\"/feature highlight content.",
        "Any remaining Home page descriptive text is updated so it does not mention patient intake (Billing-focused copy only)."
      ]
    },
    {
      "id": "REQ-81",
      "text": "Remove the Intake route from the app routing configuration so the Intake page is not part of the navigable application flow; ensure that directly visiting \"/intake\" does not present the Intake page content (redirect to \"/billing\" or show a not-found style outcome).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "1. Remove the Intake Menu and its associated blogs its not required",
          "2. Remove patient intake from dashboad I only want billing"
        ]
      },
      "acceptanceCriteria": [
        "The TanStack Router route definition for path \"/intake\" no longer renders the Intake page UI.",
        "Direct navigation to \"/intake\" does not display the Intake page content; users are instead sent to a Billing-relevant destination (e.g., \"/billing\") or an equivalent not-found experience.",
        "No other existing Billing, Hospice Billing, Manifest, or Receivables routes are broken by this change."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not introduce any new backend services or databases; changes in this request should be achievable purely in the frontend."
  ],
  "nonGoals": [
    "Do not remove or change any Billing, Hospice Billing (Manifest LOC/R&B), or Account/Receivables functionality.",
    "Do not change invoice creation, receivables listing, delete behavior, or the Claim details popup as part of this request.",
    "Do not change branding assets (PD group logo) or existing generated images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Operate the application as a Billing-only experience (no Intake workflows)."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Remove Intake navigation and Intake-related dashboard content."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}