{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Manifest LOC Billing Display to always show sample record (frontend)",
  "requirements": [
    {
      "id": "REQ-49",
      "summary": "Ensure Manifest LOC Billing “Display” reliably shows the required sample inquiry row, restoring it when it was previously invoiced while keeping other invoiced inquiries excluded.",
      "acceptanceCriteria": [
        "On the Manifest LOC Billing page, clicking “Display” shows a row with Client=PhilipTest, MR#=KT99, Statement period=1/1/2026–1/31/2026, Payer/Payorsource=NGS, Amount=3100.",
        "If the sample inquiry exists in backend state but is currently marked as invoiced (and thus would be filtered out), the system automatically makes it available again so it appears after clicking “Display”.",
        "The “Display” action continues to exclude other inquiries that are marked as invoiced; only the sample record is force-restored to satisfy the required display behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ManifestLocBilling.tsx",
          "operation": "modify",
          "description": "Update the Display flow to (1) refetch inquiries, (2) detect the sample inquiry by its exact details even if currently invoiced, (3) if the sample exists but is invoiced, invoke the backend reset capability via a dedicated React Query mutation, then refetch and render only non-invoiced inquiries so the restored sample row appears while other invoiced inquiries remain excluded."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook that calls the backend reset capability for the LOC sample record (using the existing actor method that resets/deletes the sample invoice) and invalidates/refetches inquiries (and invoices if needed) so the billing grid can re-render the restored sample inquiry."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "When the sample inquiry is missing on “Display” due to being previously invoiced, call the backend reset capability, then refetch and render the restored inquiry; preserve existing empty-state and error handling behavior.",
      "acceptanceCriteria": [
        "When “Display” is clicked and the sample inquiry is not found among non-invoiced inquiries, the page triggers the backend reset for the sample record, then refetches inquiries and renders the sample row.",
        "No new user-facing text is required beyond existing UI labels; if an error occurs, it may be logged to console as currently done, but the normal success path must show the sample row.",
        "The grid still shows the exact empty-state message “No record, Click on display button” only when there are no available (non-invoiced) inquiries after the display flow completes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ManifestLocBilling.tsx",
          "operation": "modify",
          "description": "Implement conditional reset+refetch logic: after initial refetch, if the sample row is not present in the non-invoiced set but exists as invoiced (or is absent due to prior sample invoicing behavior), call the new reset mutation, then refetch and set displayedInquiries to the final non-invoiced set. Keep existing UI labels and preserve the exact empty-state message when the final non-invoiced set is empty; log errors to console on failures."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Expose the reset mutation hook for the LOC sample record to the Manifest LOC Billing page and ensure it integrates with existing cache invalidation so the page can refetch and render the restored inquiry without adding new user-facing text."
        }
      ]
    }
  ]
}