{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Billing-only UI: remove Intake navigation, dashboard content, and route",
  "requirements": [
    {
      "id": "REQ-79",
      "summary": "Remove the Intake top-level navigation item from the Header so navigation is Billing-focused.",
      "acceptanceCriteria": [
        "The header no longer renders a top-level navigation link labeled \"Intake\".",
        "The remaining header menus (e.g., Billing and Account) continue to function and open/close as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove the \"/intake\" Link and any \"Intake\" label rendering from the header navigation while keeping Billing/Account dropdown behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-80",
      "summary": "Remove Intake promotional/CTA content from the Home dashboard and update copy to be Billing-only.",
      "acceptanceCriteria": [
        "Home page no longer contains a CTA button/link that navigates to \"/intake\" or is labeled \"Patient Intake\"/\"Intake\".",
        "Home page no longer contains an \"Intake\" service card or any intake-related \"blog\"/feature highlight content.",
        "Any remaining Home page descriptive text is updated so it does not mention patient intake (Billing-focused copy only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Remove the hero CTA Link to \"/intake\", remove the Intake service card/section Link to \"/intake\", and update the hero/marketing copy to be Billing-focused only."
        }
      ]
    },
    {
      "id": "REQ-81",
      "summary": "Remove the Intake page from the TanStack Router flow and ensure visiting /intake does not show Intake UI (redirect or not-found style behavior).",
      "acceptanceCriteria": [
        "The TanStack Router route definition for path \"/intake\" no longer renders the Intake page UI.",
        "Direct navigation to \"/intake\" does not display the Intake page content; users are instead sent to a Billing-relevant destination (e.g., \"/billing\") or an equivalent not-found experience.",
        "No other existing Billing, Hospice Billing, Manifest, or Receivables routes are broken by this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IntakeRedirect.tsx",
          "operation": "create",
          "description": "Create a minimal route component used only for \"/intake\" that immediately sends users to a Billing-relevant destination (preferably \"/billing\") and does not display any Intake page content."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the import and route configuration that renders the Intake page, and replace the \"/intake\" route with a redirect/not-found style route (e.g., using the new IntakeRedirect component) without impacting existing Billing/Hospice/Manifest/Receivables routes."
        },
        {
          "path": "frontend/src/pages/Intake.tsx",
          "operation": "delete",
          "description": "Remove the unused Intake page implementation so it cannot be rendered by routing and is no longer part of the app flow."
        }
      ]
    }
  ]
}